/*Задача 9. Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?
Вземете бележката от масата, на нея пише в кое чекмедже (на скрина)
ще намерите бележката, на която пише къде е палтото (в гардероба);
Обърнете внимание на броя на звездичките! */

#include <stdio.h>
int main(void){
    int a=5;
    int *aPtr=&a; // pointer kym promenliva a
    int **aPtrPtr=&aPtr; // pointer kum pointer kym promenliva
    **aPtrPtr=15;
    printf("%d\n", a); //15

    return 0;
}